{"1": ["Python Tutorial: Zip Files – Creating and Extracting Zip Archives", "In this video, we will be learning how to create and extract zip archives. We will start by using the zipfile module, and then we will see how to do this using the shutil module. We will learn how to do this with single files and directories, as well as learning how to use gzip as well. Let’s get started…", "https://www.youtube.com/watch?v=z0gguhEmWiY"], "2": ["Python Data Science Tutorial: Analyzing the 2019 Stack Overflow Developer Survey", "In this Python Programming video, we will be learning how to download and analyze real-world data from the 2019 Stack Overflow Developer Survey. This is terrific practice for anyone getting into the data science field. We will learn different ways to analyze this data and also some best practices. Let’s get started…", "https://www.youtube.com/watch?v=_P7X8tMplsw"], "3": ["Python Multiprocessing Tutorial: Run Code in Parallel Using the Multiprocessing Module", "In this Python Programming video, we will be learning how to run code in parallel using the multiprocessing module. We will also look at how to process multiple high-resolution images at the same time using a ProcessPoolExecutor from the concurrent.futures module. Let’s get started…", "https://www.youtube.com/watch?v=fKl2JW_qrso"], "4": ["Python Threading Tutorial: Run Code Concurrently Using the Threading Module", "In this Python Programming video, we will be learning how to run threads concurrently using the threading module. We will also look at how to download multiple high-resolution images online using a ThreadPoolExecutor from the concurrent.futures module. Let’s get started…", "https://www.youtube.com/watch?v=IEEhzQoKtQU"], "5": ["Update (2019-09-03)", "Hey everyone. I wanted to give you an update on my videos. I will be releasing videos on threading and multiprocessing within the next week. Thanks so much for your patience. I currently have a temporary recording studio setup at my Airbnb that will allow me to record and edit the threading/multiprocessing videos. I am going to be moving into my new house in 10 days and once I have my recording studio setup then you can expect much faster video releases. I really appreciate how patient everyone has been while I go through this move, especially those of you who are contributing monthly through YouTube ", null], "6": ["Python Quick Tip: The Difference Between “==” and “is” (Equality vs Identity)", "In this Python Programming Tutorial, we will be learning the difference between using “==” and the “is” keyword when doing comparisons. The difference between these is that “==” checks to see if values are equal, and the “is” keyword checks their identity, which means it’s going to check if the values are identical in terms of being the same object in memory. We’ll learn more in the video. Let’s get started…", "https://www.youtube.com/watch?v=mO_dS3rXDIs"], "7": ["Python Tutorial: Calling External Commands Using the Subprocess Module", "In this Python Programming Tutorial, we will be learning how to run external commands using the subprocess module from the standard library. We will learn how to run commands, capture the output, handle errors, and also how to pipe output into other commands. Let’s get started…", "https://www.youtube.com/watch?v=2Fp1N6dof0Y"], "8": ["Visual Studio Code (Windows) – Setting up a Python Development Environment and Complete Overview", "In this Python Programming Tutorial, we will be learning how to set up a Python development environment in VSCode on Windows. VSCode is a very nice free editor for writing Python applications and many developers are now switching over to this editor. In this video, we will learn how to install VSCode, get the Python extension installed, how to change Python interpreters, create virtual environments, format/lint our code, how to use Git within VSCode, how to debug our programs, how unit testing works, and more. We have a lot to cover, so let’s go ahead and get started…", "https://www.youtube.com/watch?v=-nh9rCzPJ20"], "9": ["Visual Studio Code (Mac) – Setting up a Python Development Environment and Complete Overview", "In this Python Programming Tutorial, we will be learning how to set up a Python development environment in VSCode on MacOS. VSCode is a very nice free editor for writing Python applications and many developers are now switching over to this editor. In this video, we will learn how to install VSCode, get the Python extension installed, how to change Python interpreters, create virtual environments, format/lint our code, how to use Git within VSCode, how to debug our programs, how unit testing works, and more. We have a lot to cover, so let’s go ahead and get started…", "https://www.youtube.com/watch?v=06I63_p-2A4"], "10": ["Clarifying the Issues with Mutable Default Arguments", "In this Python Programming Tutorial, we will be clarifying the issues with mutable default arguments. We discussed this in my last video titled “5 Common Python Mistakes and How to Fix Them”, but I received many comments from people who were still confused. So we will be doing a deeper dive to explain exactly what is going on here. Let’s get started…", "https://www.youtube.com/watch?v=_JGmemuINww"], "11": ["5 Common Python Mistakes and How to Fix Them", "In this Python Programming Tutorial, we will be going over some of the most common mistakes. I get a lot of questions from people every day, and I have seen a lot of people making these same mistakes in their code. So we will investigate each of these common mistakes and also look at the fixes for each other these as well. Here are the timestamps for each topic we will cover… 1) Indentation and Spaces – 0:45 2) Naming Conflicts – 4:12 3) Mutable Default Args – 10:05 4) Exhausting Iterators – 16:35 5) Importing with * – 22:13", "https://www.youtube.com/watch?v=zdJEYhA2AZQ"], "12": ["How I Setup a New Development Machine – Using Scripts to Automate Installs and Save Time", "In this video, I’ll be showing how I set up a new development machine. I recently got a new MacBook and wanted to show how I use scripts to automate a lot of this process. It used to take me a lot of time to install all of my software and get everything set up the way I like it. Now I use these automated scripts to do this in minutes. Let’s get started…", "https://www.youtube.com/watch?v=kIdiWut8eD8"], "13": ["How to Write Python Scripts to Analyze JSON APIs and Sort Results", "In this Python Programming Tutorial, we will be learning how to grab data from a JSON API, parse out the information we want, and then sort the data using a custom key. The API we will be using is a JSON API for Homebrew Packages and we will be sorting the packages by their popularity. We cover a lot of topics in this tutorial. We will be using the Requests Library, converting to/from JSON, reading and writing to files, writing our own sorting function, and more. Let’s get started…", "https://www.youtube.com/watch?v=1lxrb_ezP-g"], "14": ["Homebrew Tutorial: Simplify Software Installation on Mac Using This Package Manager", "In this video, we’ll be learning how to use the Homebrew Package Manager on MacOS. Brew allows us to easily install command-line tools with a simple command. We can also install native applications for Mac using Brew Cask. I often use these commands in scripts to install a lot of new software quickly and easily on new machines. Let’s get started…", "https://www.youtube.com/watch?v=SELYgZvAZbU"], "15": ["Python Tutorial: VENV (Windows) – How to Use Virtual Environments with the Built-In venv Module", "In this Python Programming Tutorial, we will be learning how to use virtual environments on the Windows operating systems with the built-in venv module. We will learn how to create them, activate them, remove them, and much more. Let’s get started…", "https://www.youtube.com/watch?v=APOPm01BVrk"], "16": ["Python Tutorial: VENV (Mac & Linux) – How to Use Virtual Environments with the Built-In venv Module", "In this Python Programming Tutorial, we will be learning how to use virtual environments on the Mac and Linux operating systems with the built-in venv module. We will learn how to create them, activate them, remove them, and much more. Let’s get started…", "https://www.youtube.com/watch?v=Kg1Yvry_Ydk"], "17": ["10 Python Tips and Tricks For Writing Better Code", "In this Python Programming video, we will be going over 10 tips and tricks for writing Pythonic code. Here are the timestamps for each topic we will cover… 1) Ternary Conditionals – 0:34 2) Underscore Placeholders – 2:13 3) Context Managers – 4:25 4) Enumerate – 6:50 5) Zip – 8:52 6) Unpacking – 13:02 7) Setattr/Getattr – 19:08 8) GetPass – 26:24 9) Python dash m – 29:18 10) Help/Dir – 33:17 ", "https://www.youtube.com/watch?v=C-gEQdGVXbk"], "18": ["How to Send Emails Using Python – Plain Text, Adding Attachments, HTML Emails, and More", "In this Python Programming Tutorial, we will be learning how to send emails. We’ll start with simple plain text emails and then learn how to construct more advanced messages. We will learn how to attach images, PDFs, create HTML messages, and more. Let’s get started…", "https://www.youtube.com/watch?v=JRCJ6RtE3xU"], "19": ["Python Tutorial: Web Scraping with Requests-HTML", "In this Python Programming Tutorial, we will be learning how to scrape websites using the Requests-HTML library. Requests-HTML is an excellent tool for parsing HTML code and grabbing exactly the information you need. So whether you’re pulling down headlines from news sites, scores from sports websites, or prices from an online store… Requests-HTML and Python will help you get this done quickly and easily. Let’s get started… ", "https://www.youtube.com/watch?v=a6fIbtFB46g"], "20": ["Python Tutorial: Write a Script to Monitor a Website, Send Alert Emails, and Reboot Servers", "In this Python Programming Tutorial, we’re going to be looking at a real-world example of writing a script to monitor a website. If the website doesn’t return a successful response for any reason then we will send an email and reboot the web server. Let’s get started…", "https://www.youtube.com/watch?v=yqm6MBt-yfY"], "21": ["Python Requests Tutorial: Request Web Pages, Download Images, POST Data, Read JSON, and More", "In this Python Programming Tutorial, we will be learning how to use the Requests library. The Requests library allows us to send HTTP requests and interact with web pages. We will be learning how to grab the source code of a site, download images, POST form data to routes, read JSON responses, perform authentication, and more. Let’s get started…", "https://www.youtube.com/watch?v=tb8gHvYlCFs"], "22": ["Python Django Tutorial: Deploying Your Application (Option #2) – Deploy using Heroku", "In this Python Django Tutorial, we will be learning how to deploy our application to Heroku. Heroku is a platform that abstracts away a lot of the low-level system administration and allows us to easily deploy, update, and rollback changes for our application. Let’s get started…", "https://www.youtube.com/watch?v=6DI_7Zja8Zc"], "23": ["Python Django Tutorial: Full-Featured Web App Part 13 – Using AWS S3 for File Uploads", "In this Python Django Tutorial, we will be learning how to set up AWS S3 so that we can host our media files from that service instead of our local filesystem. AWS S3 is very affordable and will also allow our application to scale much more than if our files lived on our local filesystem. Let’s get started…", "https://www.youtube.com/watch?v=kt3ZtW9MXhw"], "24": ["Python Django Tutorial: How to enable HTTPS with a free SSL/TLS Certificate using Let’s Encrypt", "In this Python Django Tutorial, we will be learning how to enable HTTPS on our web server with a free SSL/TLS certificate using a service called “Let’s Encrypt”. Let’s Encrypt is a Certificate Authority that lets anyone obtain, renew, and manage certificates for their site. They’re a non-profit and provide all of this for free, and it’s easy to get running on our server, so let’s go ahead and get started…", "https://www.youtube.com/watch?v=NhidVhNHfeU"], "25": ["Python Flask Tutorial: How to enable HTTPS with a free SSL/TLS Certificate using Let’s Encrypt", "In this Python Flask Tutorial, we will be learning how to enable HTTPS on our web server with a free SSL/TLS certificate using a service called “Let’s Encrypt”. Let’s Encrypt is a Certificate Authority that lets anyone obtain, renew, and manage certificates for their site. They’re a non-profit and provide all of this for free, and it’s easy to get running on our server, so let’s go ahead and get started…", "https://www.youtube.com/watch?v=Gdys9qPjuKs"], "26": ["Python Django Tutorial: How to Use Custom Domain Name For Our Application", "In this Python Django Tutorial, we will be learning how to set up a custom domain name for our application. We will use NameCheap as our domain registrar and Linode to host our server. Let’s get started…", "https://www.youtube.com/watch?v=D2lwk1Ukgz0"], "27": ["Python Flask Tutorial: How to Use Custom Domain Name For Our Application", "In this Python Flask Tutorial, we will be learning how to set up a custom domain name for our application. We will use NameCheap as our domain registrar and Linode to host our server. Let’s get started…", "https://www.youtube.com/watch?v=LUFn-QVcmB8"], "28": ["Python Flask Tutorial: Deploying Your Application (Option #1) – Deploy to a Linux Server", "In this Python Flask Tutorial, we will be learning how to deploy our application to a Linux Server from scratch using Linode. We will be covering the entire deployment of a Flask application. This includes spinning up a new Linux Server and tightening its security with SSH keys and firewalls. Then we will install Nginx and Gunicorn so that we can get our Flask App running. Let’s get started…", "https://www.youtube.com/watch?v=goToXTC96Co"], "29": ["Python Django Tutorial: Deploying Your Application (Option #1) – Deploy to a Linux Server", "In this Python Django Tutorial, we will be learning how to deploy our application to a Linux Server from scratch using Linode. We will be covering the entire deployment of a Django application. This includes spinning up a new Linux Server and tightening its security with SSH keys and firewalls. Then we will install Apache and Mod_WSGI so that we can get our Django App running. Let’s get started…", "https://www.youtube.com/watch?v=Sa_kQheCnds"], "30": ["Python Tutorial: Itertools Module – Iterator Functions for Efficient Looping", "In this Python Programming Tutorial, we will be learning about the itertools module. The itertools module is a collection of functions that allows us to work with iterators in an efficient way. Depending on your problem, this can save you a lot of memory and also a lot of work. Let’s get started…", "https://www.youtube.com/watch?v=Qu3dThVy6KQ"], "31": ["Python Coding Problem: Creating Your Own Iterators", "In this Python Coding Problem, we will be creating our own iterators from scratch. First, we will create an iterator using a class. Then we will create an iterator with the same functionality using a generator. If you haven’t watched the tutorial video on Iterators and Iterables then I would suggest watching that first. With that said, let’s get started…", "https://www.youtube.com/watch?v=C3Z9lJXI6Qw"], "32": ["Python Tutorial: Iterators and Iterables – What Are They and How Do They Work?", "In this Python Programming Tutorial, we will be learning about iterators and iterables. There is a lot of confusion around these terms and exactly what they mean. We’re also going to learn how to make an object ourselves that is both an iterable and an iterator. This video isn’t only about understanding these definitions. It’s also about understanding the concepts of iterators so that you can write better code. Understanding these underlying concepts is going to help you write code that is more efficient and will also help you see solutions to certain problems in a way you might not have thought of before. So with that said, let’s get started…", "https://www.youtube.com/watch?v=jTYiNjvnHZY"], "33": ["Python Tutorial: Pipenv – Easily Manage Packages and Virtual Environments", "In this Python Programming Tutorial, we will be learning how to use Pipenv. Pipenv is a new package manager that combines pip and virtualenv into one easy-to-use tool. We will learn how to install pipenv, how to install new packages, how to manage our newly created environment for our project, and also look at some more advanced use cases. Let’s get started…", "https://www.youtube.com/watch?v=zDYL22QNiWk"], "34": ["Python Django Tutorials – Full Series", "In this Python Django Tutorial, we will be learning how to get started using the Django framework. We will install the necessary packages and get a basic application running in our browser.", "https://www.youtube.com/watch?v=UmljXZIypDc"], "35": ["Best Sublime Text Features and Shortcuts", "In this video, we will be learning about my favorite Sublime Text features and shortcuts for Windows. Knowing your way around your text editor will help you get things done much faster and be more productive. The features in this video have saved me a ton of time over the years. I have two different versions of this video depending on your operating system…", "https://www.youtube.com/watch?v=9FPFogHkgOc"], "36": ["Python Tutorial: How to Set the Path and Switch Between Different Versions/Executables", "In this Python Programming Tutorial, we will be learning how to set the PATH environment variable. We will also learn how to modify the PATH in order to switch between different Python versions and executables. This is an essential skill that trips up many people when they first start learning Python and will definitely help you in many real-world situations. I have two different versions of this video depending on your operating system…", "https://www.youtube.com/watch?v=OdIHeg4jj2c"], "37": ["Python Quick Tip: F-Strings – How to Use Them and Advanced String Formatting", "In this Python Programming Tutorial, we will be learning how to use f-strings to format strings. F-strings are new to Python3.6+ and are extremely useful once you learn how to use them. Viewers have likely seen me use f-strings in previous videos so this video will go into detail exactly how to use them so that everyone can follow along confidently. Let’s get started…", "https://www.youtube.com/watch?v=nghuHvKLhJA"], "38": ["Big Announcements, Video Updates, and Future Plans", "For those of you who don’t know, I recently quit my previous job and will now be doing tutorials on YouTube full-time. In this video, we discuss what to expect now that this is a full-time job, and also some details about how all this will work. Thanks again to all of you who made it possible to do what I love full-time.", "https://www.youtube.com/watch?v=OPUP4ghN9oo"], "39": ["Python Tutorial: Sets – Set Methods and Operations to Solve Common Problems", "In this Python Programming Tutorial, we will be looking at the Set data structure in-depth and discovering how it can help us solve some common problems. The set can not only solve certain problems more quickly but is also more efficient in many cases.", "https://www.youtube.com/watch?v=r3R3h5ly_8g"], "40": ["Python Flask Tutorials – Full Series", "In this Python Flask Tutorial, we will be learning how to get started using the Flask framework. We will install the necessary packages and get a basic Hello World Application running in our browser.", "https://www.youtube.com/watch?v=MwZwr5Tvyxo"], "41": ["Linux/Mac Terminal Tutorial: The Grep Command – Search Files and Directories for Patterns of Text", "In this Linux/Mac terminal tutorial, we will be learning how to use the grep command. The grep command allows us to search files and directories for patterns of text. You can also pipe the output of one command into grep to get certain matches. It’s extremely useful once you learn the ins and outs. Let’s get started…", "https://www.youtube.com/watch?v=VGgTmxXp7xQ"], "42": ["How to Run Linux/Bash on Windows 10 Using the Built-In Windows Subsystem for Linux", "In this video, we will be learning how to run Linux on Windows using the new Windows Subsystem for Linux that comes with Windows 10. This is an excellent way to run Bash on a Windows machine. It allows you to use all of the Bash commands we are used to using on Linux within a Windows system. We will be showing how to enable and install Linux on Windows and also go over a quick overview to see how this works. Let’s get started…", "https://www.youtube.com/watch?v=xzgwDbe7foQ"], "43": ["Python Quick Tip: Hiding Passwords and Secret Keys in Environment Variables (Windows)", "In this Python Programming Tutorial, we will be learning how to hide passwords and secret information within environment variables on Windows machines. Hard-coding secret information is a common mistake that beginners make when learning Python. Hiding this information within environment variables allows you to access your secret information within your code without anyone else being able to see these values from your source code. Let’s get started…", "https://www.youtube.com/watch?v=IolxqkL7cD8"], "44": ["Python Quick Tip: Hiding Passwords and Secret Keys in Environment Variables (Mac & Linux)", "In this Python Programming Tutorial, we will be learning how to hide passwords and secret information within environment variables on Mac and Linux machines. Hard-coding secret information is a common mistake that beginners make when learning Python. Hiding this information within environment variables allows you to access your secret information within your code without anyone else being able to see these values from your source code. Let’s get started…", "https://www.youtube.com/watch?v=5iWhQWVXosU"], "45": ["Python Tutorial: Calculate Number of Days, Weeks, or Months to Reach Specific Goals", "In this Python Programming Tutorial, we will be writing three different scripts to estimate how long it will take to reach certain goals. Our first script will calculate how many months it will take us to pay off a credit card. Our second script will calculate how many weeks it will take to lose a certain amount of weight. And our third script will estimate how long it will take to reach a certain number of subscribers. Let’s get started…", "https://www.youtube.com/watch?v=k8asfUbWbI4"], "46": ["Python Tutorial: Context Managers – Efficiently Managing Resources", "In this Python Programming Tutorial, we will be learning how to use context managers to properly manage resources. Context Managers are great for when we need to setup or teardown some resources during use. So these can be used for: open and closing files, opening and closing database connections, acquiring and releasing locks, and much much more. Let’s get started…", "https://www.youtube.com/watch?v=-aKFBoZpiqA"], "47": ["Channel Update: Look Back on the Year and Big Plans for 2018", "In this Channel Update, we will be looking back on 2017 and what we’ve done this year. We will also be looking forward to 2018 and discussing the future plans for this channel. This year was the best year for this channel yet and I can’t thank you all enough. I have plenty planned for the future and I look forward to putting out great tutorials next year!", "https://www.youtube.com/watch?v=CtgkEaeOkew"], "48": ["Python Tutorial: Working with JSON Data using the json Module", "In this Python Programming Tutorial, we will be learning how to work with JSON data. We will learn how to load JSON into Python objects from strings and how to convert Python objects into JSON strings. We will also see how to load JSON from a file and save those Python objects back to files. Let’s get started…", "https://www.youtube.com/watch?v=9N6a-VLBa2I"], "49": ["Python Tutorial: Web Scraping with BeautifulSoup and Requests", "In this Python Programming Tutorial, we will be learning how to scrape websites using the BeautifulSoup library. BeautifulSoup is an excellent tool for parsing HTML code and grabbing exactly the information you need. So whether you’re pulling down headlines from news sites, scores from sports websites, or prices from an online store… BeautifulSoup and Python will help you get this done quickly and easily. Let’s get started…", "https://www.youtube.com/watch?v=ng2o98k983k"], "50": ["Python Tutorial: re Module – How to Write and Match Regular Expressions (Regex)", "In this Python Programming Tutorial, we will be learning how to read, write, and match regular expressions with the re module. Regular expressions are extremely useful for matching common patterns of text such as email addresses, phone numbers, URLs, etc. Learning how to do this within Python will allow us to quickly parse files and text for the information we need. Let’s get started…", "https://www.youtube.com/watch?v=K8L6KVGG-7o"], "51": ["Linux/Mac Terminal Tutorial: How To Use The rsync Command – Sync Files Locally and Remotely", "In this Linux/Mac terminal tutorial, we will be learning how to use the rsync command. The rsync command will allow you to sync file and directories on your local machine or even over a network between servers. This is a great tool for running backups, for only copying diffs, or even for deploying segments of code. Let’s get started…", "https://www.youtube.com/watch?v=qE77MbDnljA"], "52": ["Regular Expressions (Regex) Tutorial: How to Match Any Pattern of Text", "In this regular expressions (regex) tutorial, we’re going to be learning how to match patterns of text. Regular expressions are extremely useful for matching common patterns of text such as email addresses, phone numbers, URLs, etc. Almost every programming language has a regular expression library, so learning regular expressions with not only help you with finding patterns in your text editors, but also you’ll be able to use these programming libraries to search for patterns programmatically as well. Let’s get started…", "https://www.youtube.com/watch?v=sa-TUpSx1JA"], "53": ["5 Essential Skills Every Well-Rounded Programmer Should Know", "In this video, we will be looking at 5 skills that you can learn on top of your main programming language to make you a well-rounded programmer. These skills will make you more marketable when looking for a job, and can sometimes be the deciding factor when choosing between candidates.", "https://www.youtube.com/watch?v=TtIJEQ6D9DE"], "54": ["Python Tutorial: How I Manage Multiple Projects, Virtual Environments, and Environment Variables", "In this Python Programming Tutorial, I will be showing how I personally manage multiple projects, virtual environments, and environment variables. If you have ever worked on multiple projects, you probably know that it can be a hassle to keep all of your dependencies and project information separate. The strategy I have adopted over the years allows me to easily separate out my environments in such a way that they can be easily exported, activated, and also automatically activate the correct environment variables. Let’s get started…", "https://www.youtube.com/watch?v=cY2NXB_Tqq0"], "55": ["Python Tutorial: Generate Random Numbers and Data Using the random Module", "In this Python Programming Tutorial, we will be learning how to generate random numbers and choose random data from lists using the random module. I personally use the random module pretty often in my tutorials to generate random data. This can also be used be games, simulations, and plenty of other useful tasks. Let’s get started…", "https://www.youtube.com/watch?v=KzqSDvzOFNA"], "56": ["Linux/Mac Tutorial: Cron Jobs – How to Schedule Commands with crontab", "In this Linux/Mac terminal tutorial, we will be learning about cron jobs and how to schedule commands with crontab. The will allow you to run commands on a repetitive schedule. So if you want to run a job daily, weekly, or at a certain time of day, this video will show you how you can get this set up. This helps a ton with system administration type of tasks and can automate a lot of work. Let’s get started.", "https://www.youtube.com/watch?v=QZJ1drMQz1A"], "57": ["Python Tutorial: Unit Testing Your Code with the unittest Module", "In this Python Programming Tutorial, we will be learning how to unit-test our code using the unittest module. Unit testing will allow you to be more comfortable with refactoring and knowing whether or not your updates broke any of your existing code. Unit testing is a must on any large projects and is used by all major companies. Not only that, but it will greatly improve your personal code as well. Let’s get started.", "https://www.youtube.com/watch?v=6tNS--WetLI"], "58": ["Python Tutorial: CSV Module – How to Read, Parse, and Write CSV Files", "In this Python Programming Tutorial, we will be learning how to work with csv files using the csv module. We will learn how to read, parse, and write to csv files. CSV stands for “Comma-Separated Values”. It is a common format for storing information. Knowing how to read, parse, and write this information to files will open the door to working with a lot of data throughout the world. Let’s get started.", "https://www.youtube.com/watch?v=q5uM4VKywbA"], "59": ["Linux/Mac Tutorial: SSH Key-Based Authentication – How to SSH Without a Password", "In this Linux/Mac terminal tutorial, we will be learning how to configure ssh keys so that we can login to our servers without a password. Not only is this more convenient, but it is also more secure. This also allows us to write automated scripts to talk to our servers without the need of putting in passwords constantly. Let’s get started.", "https://www.youtube.com/watch?v=vpk_1gldOAE"], "60": ["Python Tutorial: Real World Example – Parsing Names From a CSV to an HTML List", "In this Python Programming Tutorial, we’ll be learning how to parse a CSV file and output the data to an HTML unordered list. This is a real world problem I ran into with my website. The list was becoming too large for me to maintain manually, so writing a Python script to automate this process saved me a lot of time in the future. Let’s get started.", "https://www.youtube.com/watch?v=bkpLhQd6YQM"], "61": ["How to Create a Network of Machines in VirtualBox with SSH Access", "In this video, we’ll be learning how to clone Virtual Machines, add these machines to a network so they can communicate with each other, make sure they have internet access, and also set up SSH so that we are able to SSH into these machines from our host machine. This will allow us to pretty much build an entire virtual lab that we can use to test all kinds of different software. So after we’re done, this will give us the ability to quickly spin up a new VM that behaves just like a real machine on our network. Let’s get started.", "https://www.youtube.com/watch?v=S7jD6nnYJy0"], "62": ["VirtualBox: How to Use Snapshots", "In this video, we will be learning how to use snapshots within VirtualBox. Snapshots are great for saving a machine state and being able to revert back to a previous time. Let’s get started.", "https://www.youtube.com/watch?v=Qte4X-rdr2Q"], "63": ["Python Beginner Tutorials – Complete Series", "Welcome to a nine-part series on Python Programming for Beginners. We’ll go over the installation/setup, data types, conditionals, loops, functions, how to import modules and explore the standard library. You can find each individual video down below, or view the entire playlist here", "https://www.youtube.com/watch?v=YYXdXT2l-Gg"], "64": ["Python SQLite Tutorial: Complete Overview – Creating a Database, Table, and Running Queries", "In this Python SQLite tutorial, we will be going over a complete introduction to the sqlite3 built-in module within Python. SQLite allows us to quickly get up and running with databases, without spinning up larger databases like MySQL or Postgres. We will be creating a database, creating a table, insert, select, update, and delete data. Let’s get started…", "https://www.youtube.com/watch?v=pd-0G0MigUA"], "65": ["Channel Update: Code Snippets, New Rewards, and Playlists", "In this Channel Update, we will be discussing new rewards for the supporters of the channel. We will also be discussing code snippets being posted to GitHub and playlists being arranged properly.", "https://www.youtube.com/watch?v=4qMJN1pY_aw"], "66": ["Python Tutorial: Decorators With Arguments", "In this Python tutorial, we will be learning how to create decorators with parameters that accept arguments. This was a highly requested video in response to my original decorator tutorial video. Accepting arguments allows us to add even more functionality to our decorators. You will see this throughout many frameworks and libraries, so it’s a good skill to know. Let’s get started…", "https://www.youtube.com/watch?v=KlBPCzcQNU8"], "67": ["Python Tutorial: Anaconda – Installation and Using Conda", "In this Python Tutorial, we will be learning how to install Anaconda by Continuum Analytics. Anaconda is a data science platform that comes with a lot of useful features right out of the box. Many people find that installing Python through Anaconda is much easier than doing so manually. Also, we will look at Conda. Conda is Continuum’s package, dependency and environment manager. Let’s get started…", "https://www.youtube.com/watch?v=YJC6ldI3hWk"], "68": ["Python Tutorial: Datetime Module – How to work with Dates, Times, Timedeltas, and Timezones", "In this Python Tutorial, we will be learning how to use the datetime module. The datetime module is important to understand, because you will be working with dates and times in just about every application you write. We will look at how to work with dates, times, datetimes, timedeltas, and timezones. Let’s get started…", "https://www.youtube.com/watch?v=eirjjyP2qcQ"], "69": ["Linux/Mac Terminal: How To Use The Find Command", "In this Linux/Mac terminal tutorial, we will be learning how to use the find command. The find command allows us to scan through our file system in order to find files and directories that meet a certain criteria. We will also learn how to perform actions on the results that are Let’s get started…", "https://www.youtube.com/watch?v=KCVaNb_zOuw"], "70": ["Python Tutorial: Logging Advanced – Loggers, Handlers, and Formatters", "In this Python Tutorial, we will be going over the some more advanced logging concepts. These will include loggers, handlers, and formatters. Let’s get started…", "https://www.youtube.com/watch?v=jxmzY9soFXg"], "71": ["Python Tutorial: Logging Basics – Logging to Files, Setting Levels, and Formatting", "In this Python Tutorial, we will be going over the basics of logging. We will learn how to switch out our print statements for logs, change the logging level, add logs to files, and also how to change the format of those logs. Let’s get started…", "https://www.youtube.com/watch?v=-ARI4Cz-awo"], "72": ["Setting up a Python Development Environment in Atom", "In this Python Tutorial, we will be setting up a development environment in Atom. We will walk through how to install Atom, install Packages, customize settings, and much more. Let’s get started…", "https://www.youtube.com/watch?v=DjEuROpsvp4"], "73": ["Setting up a Python Development Environment in Sublime Text", "In this Python Tutorial, we will be setting up a development environment in Sublime Text 3. We will walk through how to install Sublime Text, install Package Control, install Packages, and much more. Let’s get started…", "https://www.youtube.com/watch?v=xFciV6Ew5r4"], "74": ["Python Tutorial: Variable Scope – Understanding the LEGB rule and global/nonlocal statements", "In this Python Tutorial, we will be going over variable scope in Python. Scope is important because we need to understand it in just about every program we write. It allows us to understand where our variables can be seen from within our program and also what values these variables hold. It also helps with debugging, because scope is a common problem when errors are thrown. Let’s get started…", "https://www.youtube.com/watch?v=QVdf0LgmICw"], "75": ["Frequently Asked Questions #1: Text Editors, Books, Career Advice, and More", "In this video, I’ll be answering some of the most common questions I get on this channel. I receive these questions in the comment section and in personal messages.", "https://www.youtube.com/watch?v=N4WSqXtd_rk"], "76": ["Jupyter Notebook Tutorial: Introduction, Setup, and Walkthrough", "In this Python Tutorial, we will be learning how to install, setup, and use Jupyter Notebooks. Jupyter Notebooks have become very popular in the last few years, and for good reason. They allow you to create and share documents that contain live code, equations, visualizations and markdown text. This can all be run from directly in the browser. It is an essential tool to learn if you are getting started in Data Science, but will also have tons of benefits outside of that field. Let’s get started…", "https://www.youtube.com/watch?v=HW29067qVWk"], "77": ["Python OOP Tutorials – Complete Series", "In this Python Object-Oriented Tutorial, we will begin our series by learning how to create and use classes within Python. Classes allow us to logically group our data and functions in a way that is easy to reuse and also easy to build upon if need be. Let’s get started…", "https://www.youtube.com/watch?v=ZDa-Z5JzLYM"], "78": ["Linux/Mac Terminal: How To Use The cURL Command", "In this Linux/Mac terminal tutorial, we will be learning how to use the cURL command. The curl command allows us to query URLs from the command line. Not only can we make regular requests, but we can POST data, authenticate users, save responses to files, and many other useful actions. Let’s get started…", "https://www.youtube.com/watch?v=WxUVU0b95Oc"], "79": ["How to Install Ubuntu 16.04 LTS on VirtualBox with Guest Additions", "In this video, we will be installing Ubuntu 16.04 LTS on VirtualBox. Installing Linux on VirtualBox is a great way to experiment with Linux in an isolated environment. I plan on doing many Linux tutorials in the near future, so whether you are on Windows and would like to follow along, or would just like to experiment with Linux, this will be a good starting point. Let’s get started…", "https://www.youtube.com/watch?v=-2x-5DN-caM"], "80": ["Channel Update: 5000 Subscribers, Future Tutorials, and Giveaway", "In this video I’ll give a quick update with the current status of the channel. We are rapidly approaching 5000 subscribers and I would like to give a big ‘Thank You’ to everyone who has subscribed. I’ll also go over my plans for future videos, and also we will look at the book giveaway that is taking place on my website.", "https://www.youtube.com/watch?v=llBzkEatyN0"], "81": ["Python Tutorial: File Objects – Reading and Writing to Files", "In this Python Tutorial, we will be learning how to read and write to files. You will likely come into contact with file objects at some point while using Python, so knowing how to read and write from them is extremely important. We will learn how to read and write from simple text files, open multiple files at once, and also how to copy image binary files. Let’s get started.", "https://www.youtube.com/watch?v=Uh2ebFW8OYM"], "82": ["Python Tutorial: OS Module – Use Underlying Operating System Functionality", "In this Python Tutorial, we will be going over the ‘os’ module. The os module allows us to access functionality of the underlying operating system. So we can perform tasks such as: navigate the file system, obtain file information, rename files, search directory trees, fetch environment variables, and many other operations. We will cover a lot of what the os module has to offer in this tutorial, so let’s get started.", "https://www.youtube.com/watch?v=tJxcKyFMTGo"], "83": ["Python Tutorial: Decorators – Dynamically Alter The Functionality Of Your Functions", "In this Python tutorial, we will be learning about decorators. Decorators are a way to dynamically alter the functionality of your functions. So for example, if you wanted to log information when a function is run, you could use a decorator to add this functionality without modifying the source code of your original function. So let’s take a look at how these decorators work and a few ways in which we can use them. Let’s get started.", "https://www.youtube.com/watch?v=FsAPt_9Bf3U"], "84": ["Python Tutorial: String Formatting – Advanced Operations for Dicts, Lists, Numbers, and Dates", "In this Python tutorial, we will be learning how to perform some advanced string formatting operations. Formatting our strings allows us to display our information in exactly the way we would like it to be displayed. Everyone, in almost all areas of Python programming, comes across a situation where they need to format a data type in a specific way. Let’s get started.", "https://www.youtube.com/watch?v=vTX3IwquFkc"], "85": ["Programming Terms: Closures – How to Use Them and Why They Are Useful", "In this programming terms video, we will be looking at the term “Closure”. We will learn what a closure is and why they are useful. We will look at examples in both Python and JavaScript. In Python, understanding closures helps us understand common language features like decorators. And in JavaScript, closures will allow us to better understand callback functions and much more. Let’s get started…", "https://www.youtube.com/watch?v=swU3c34d2NQ"], "86": ["JavaScript Tutorial: Run JavaScript in Sublime Text with a NodeJS Build System", "In this JavaScript Tutorial, we will be learning how to create a JavaScript build system within Sublime Text. This will allow us to run JavaScript code outside of a browser environment and write messages to the Sublime Text console. Let’s get started.", "https://www.youtube.com/watch?v=1iPs43TppOY"], "87": ["Python Tutorial: Custom Sublime Text Build Systems", "In this video we will be learning how to create multiple build systems within Sublime Text. This is useful if you have projects which require you to switch between Python 2 and Python 3, or if you’d like to customize your default Python build system. Let’s get started.", "https://www.youtube.com/watch?v=xqcTfplzr7c"], "88": ["Programming Terms: First-Class Functions", "In this programming terms video, we will be looking at the term “First-Class Function”. First-class functions are extremely important to grasp because understanding them will help us understand more complicated terms such as: Closures, Higher-order functions, currying, and more. We will be looking at examples of first-class functions in both Python and JavaScript so that we can really understand the concept, regardless of programming language. Let’s get started:", "https://www.youtube.com/watch?v=kr0mpwqttM0"], "89": ["Python Tutorial: Duck Typing and Asking Forgiveness, Not Permission (EAFP)", "In this Python Tutorial, we will look at a couple of the aspects of being “Pythonic”. If you’ve never heard the term Pythonic before, basically it means that you are following conventions and coding styles of the Python language in order to write clean and readable code.", "https://www.youtube.com/watch?v=x3v9zMX1s4s"], "90": ["Customizing Your Terminal: How To Use and Modify Dotfiles", "In this video, we will be tying together all of the information we learned in our previous two videos in order to explore and customize some pre-built dotfiles. Dotfiles can be extremely powerful and some people have put in a lot of effort to squeeze a lot of functionality into theirs. Luckily, the have open sourced these dotfiles for use to explore and learn. Let’s check out how we can use these files for ourselves:", "https://www.youtube.com/watch?v=c5RZWDLqifA"], "91": ["Customizing Your Terminal: Adding Color and Information to Your Prompt", "In this video, we will be learning how to customize our terminal with dotfiles. In a previous video we learned about the difference between the .bash_profile and .bashrc files. And in this video we will be customizing those files in order to add color and information to our command prompt. In our next video we will be putting all of this together and exploring the real power of dotfiles, but before we get ahead of ourselves, let’s customize our prompt:", "https://www.youtube.com/watch?v=LXgXV7YmSiU"], "92": ["Customizing Your Terminal: .bash_profile and .bashrc files", "In the next few videos, we will be taking a look at how to customize our terminal with dotfiles. First, we need to understand the main dotfiles we will be working with, the .bashrc and .bash_profile files. What is the difference between these files and which one should you modify in order to customize your terminal? Let find out:", "https://www.youtube.com/watch?v=vDOVEDl2z84"], "93": ["Terminal Basics: Create, Copy, Move, and Delete Files and Directories", "In this video, we will be learning basic terminal commands which will allow us to create, copy, rename, move, and delete file and directories. These commands include: touch, mkdir, cp, mv, rm, as well as exploring some options we can use with these commands. Let’s get started:", "https://www.youtube.com/watch?v=eoejHvAPDFs"], "94": ["Python Tutorial: Automate Parsing and Renaming of Multiple Files", "In this video we will be writing a quick script to automate the parsing and renaming of multiple files. Writing quick scripts to automate boring and repetitive tasks is a great way to learn Python and it is a great way to save time. Let’s get started:", "https://www.youtube.com/watch?v=ve2pmm5JqmI"], "95": ["Python Tutorial: Sorting Lists, Tuples, and Objects", "In this video we will be learning how to sort lists, tuples, and other objects in Python. We will start by performing simple sorts on a list of integers and then move on to slightly more advanced sorting using custom criteria. Let’s get started:", "https://www.youtube.com/watch?v=D3JvDWO-BY4"], "96": ["Python Tutorial: Image Manipulation with Pillow", "In this video we will learn how to modify and manipulate images using the Python Pillow Library. Pillow is a fork of the Python Imaging Library (PIL). It will allow us to do many different things to our images such as: changing their file extension, resizing, cropping, changing colors, blurring, and much more.", "https://www.youtube.com/watch?v=6Qs3wObeWwc"], "97": ["Python Tutorial: Using Try/Except Blocks for Error Handling", "We’ve all run into errors and exceptions while writing Python programs. In this video, we will learn how we can handle exceptions in specific ways and also look at the control flow of a try/except/else/finally statement. Understanding how to properly handle errors will provide us with the tools to make better software in the future. Let’s get started:", "https://www.youtube.com/watch?v=NIWwJbo-9_8"], "98": ["Python: Slicing Lists and Strings", "In this video we will look at how to slice lists and strings in Python. Slicing allows us to extract certain elements from these lists and strings. This can be extremely useful for stripping out certain values from lists or getting a substring of a characters from a string. Let’s take a look at a few code examples:", "https://www.youtube.com/watch?v=ajrtAuDg3yw"], "99": ["Programming Terms: Memoization", "In this programming terms video, we will be learning the definition of the term memoization. Memoization is a technique of caching results of expensive function calls in order to speed up computer programs when the same input occurs again. Let’s take a look at some code examples to get a better understanding of how this works:", "https://www.youtube.com/watch?v=a7EjmdQzPqY"], "100": ["SQL for Beginners: UPDATE and DELETE – Modifying and Removing Records from Your Database", "In this video we will learn how to modify and remove records from our database using the UPDATE and DELETE statements. We will learn how to update and delete all the values in our table as well as updating and deleted specific values. Let’s get started:", "https://www.youtube.com/watch?v=wva2yMqcB6Q"], "101": ["SQL for Beginners: SELECT – Retrieving Records from Your Database", "In this video we will continue learning SQL Basics by retrieving records from our database using the SELECT statement. Once we learn how to use the SELECT statement, we will learn how to filter records that match a certain criteria with the WHERE Clause. Lastly, we will learn how to sort our results using the ORDER BY statement. Let’s get started:", "https://www.youtube.com/watch?v=-FPVPcq28r4"], "102": ["Git: Fixing Common Mistakes and Undoing Bad Commits", "In this video we will look at some common mistakes in Git and how we can fix these mistakes. Specifically we will cover how to discard changes since your last commit, amending commits, cherry-picking hashes, resetting to a specific commit, and reverting to a specific commit. Let’s get started:", "https://www.youtube.com/watch?v=FdZecVxzJbk"], "103": ["Setting up a Python Development Environment in Eclipse", "In this video, we will be setting up a Python development environment in Eclipse using the PyDev plugin. If you’ve watched my videos before, you have likely noticed I use the Sublime Text text editor for the tutorials. I use this for videos because it is very clean and easy to use without all the bells and whistles of a full blown IDE. But there are times when an IDE is extremely useful. For example, if you need to debug your application, an IDE is likely what you would like to use.", "https://www.youtube.com/watch?v=NDFbXIiqT4o"], "104": ["Using the New Split Screen Feature in OS X El Capitan", "I use split screen functionality a lot. As a programmer, I often have multiple windows open at the same time and need to see information from them simultaneously. For a long time I had to rely on third-party software to use split screen functionality on the Mac. With Mac’s latest release of OS X El Capitan, we now how native split screen functionality.", "https://www.youtube.com/watch?v=mvki0jCnJIk"], "105": ["Ex Machina Easter Egg – Hidden Message within Movie’s Python Code", "Sometimes when you’re watching a movie, you’ll see a flash of computer code pop up onto the screen. A lot of the time this is just gibberish. But sometimes there are hidden messages.", "https://www.youtube.com/watch?v=mJokZMWnyGY"], "106": ["Terminal Basics: Navigating your Filesystem", "The Terminal can be an intimidating place for people who are just beginning to learn how to use it. There is a fear that you will type the wrong command and somehow mess everything up.", "https://www.youtube.com/watch?v=j6vKLJxAKfw"], "107": ["SQL for Beginners: INSERT – Adding Records to Your Table", "In this video we will continue learning SQL Basics by inserting records into our table. We will learn the INSERT syntax, a couple of different ways we can add these records, and also what happens if we try to add incorrect values. Let’s get started.", "https://www.youtube.com/watch?v=fA0jpjwi4J8"], "108": ["SQL for Beginners: Creating Your First Table", "In this video we will continue learning SQL Basics by creating our first table. We will go over the syntax for creating tables and also some datatypes we can use for our table’s fields. Let’s get started.", "https://www.youtube.com/watch?v=w4HEVY_GjqY"], "109": ["SQL for Beginners: Installing PostgreSQL and Creating Your First Database", "In this video we will begin learning SQL Basics. To get started writing SQL, we need to first set up a server and a database. The server we will be using for these tutorials is Postgres. We’ll walk through how to download, install, and setup PostgreSQL. Then we will create our first database so that we can begin writing SQL code. Let’s get started.", "https://www.youtube.com/watch?v=xaWlS9HtWYw"], "110": ["Preparing for a Python Interview: 10 Things You Should Know", "The interview process can be very intimidating. There seems to be so much material to study and it may be difficult even knowing where to start.", "https://www.youtube.com/watch?v=DEwgZNC-KyE"], "111": ["Git: Difference between “add -A”, “add -u”, “add .”, and “add *”", "The “git add” command is fundamental to using Git. It is how we add files to the staging area to be committed. But which files get added? Well, that is up to us. In this video, we will look at the different options for using the add command and how we can use it to add the exact files we would like to the staging area.", "https://www.youtube.com/watch?v=tcd4txbTtAY"], "112": ["Programming Terms: Combinations and Permutations", "In this programming terms video, we will be going over the difference between combinations and permutations. Combinations are groups of values where order does not matter. Permutations are groups of values where order does matter. Let’s take a look at some examples as to when we would use one over the other.", "https://www.youtube.com/watch?v=QI9EczPQzPQ"], "113": ["Chrome Quick Tip: Quickly Bookmark Open Tabs for Later Viewing", "I often run into a problem where I have a lot of articles open in different tabs that I would like to read at a later time. I already have my Chrome set up to open specific tabs when I first open the browser and I don’t want to overwrite those, so what other option do I have? Well, it is very quick and easy to bookmark all of your open tabs and save them to a dated folder that you can then delete once you no longer need it. I’ll show you how to do this is this video. Let’s get started:", "https://www.youtube.com/watch?v=tsiSg_beudo"], "114": ["Python: Comprehensions – How they work and why you should be using them", "Python comprehensions are a very natural and easy way to create lists, dicts, and sets. They are also a great alternative to using maps and filters within python. If you are using maps, filters, or for loops to create your lists, then most likely you could and should be using comprehensions instead.", "https://www.youtube.com/watch?v=3dt4OGnU5sM"], "115": ["Python: Generators – How to use them and the benefits you receive", "Python Generators are often considered a somewhat advanced topic, but they are actually very easy to understand once you start using them on a regular basis. Actually, after you use generators for some time, you will often find them more readable and performant than other options.", "https://www.youtube.com/watch?v=bD05uGo_sVI"], "116": ["Quickest and Easiest Way to Run a Local Web-Server", "Running a local web-server to test a simple website is usually way harder than it has to be. In this video, we will look at a quick and simple way to run a local web-server without needing to download or configure anything. All you need is python (If you are on Mac or Linux, this is likely already installed). We will be using python’s SimpleHTTPServer. It’s literally as simple as navigating to your website folder and running the server. Let’s get started.", "https://www.youtube.com/watch?v=lE6Y6M9xPLw"], "117": ["Git for Beginners: Command-Line Fundamentals", "Git is the most popular version control system out there and for good reason. In this video, we’ll go over the basics of what git is and how to use it within the command-line. There are several GUI tools out there to help you get started with git, but it can be extremely beneficial to learn git from the command-line as early as possible. Let’s get started.", "https://www.youtube.com/watch?v=HVsySz-h9r4"], "118": ["Time-Saving Keyboard Shortcuts for the Mac Terminal", "A big hurdle a lot of people face when learning to use the terminal is the fact that it feels slow compared to navigating around in Finder or other GUIs. Using the terminal doesn’t have to feel slow. Once you learn a few keyboard shortcuts, it can greatly increase the speed at which you can navigate and run commands within the command line.", "https://www.youtube.com/watch?v=TXzrk3b9sKM"], "119": ["Overview of Online Learning Resources in 2015", "There’s a vast amount of websites and resources online where you can go to learn about programming, web development, web design, software engineering, or anything else you could want. A lot of these online resources are either free or cost very little money. Let me show you some of my favorites so that you can begin learning or refreshing your knowledge on a wide variety of topics.", "https://www.youtube.com/watch?v=QGy6M8HZSC4"], "120": ["Python: Else Clauses on Loops", "What does the ‘else’ clause mean when it comes after a for or while loop? This isn’t obvious at first glance, so let’s take a look at a few examples and clear up any confusion with the Python ‘else’ clause.", "https://www.youtube.com/watch?v=Dh-0lAyc3Bc"], "121": ["Programming Terms: Mutable vs Immutable", "In this programming terms video, we will be going over the difference between mutable and immutable objects. An immutable object is an object whose state cannot be modified after it is created. This is in contrast to a mutable object, which can be modified after it is created. Let’s take a look at some examples as to what exactly this means and why it is important to know.", "https://www.youtube.com/watch?v=5qQQ3yzbKp8"], "122": ["Python: Namedtuple – When and why should you use namedtuples?", "Named Tuples in Python are High-performance container datatypes. What advantage do namedtuples have over regular tuples and when should you use them? In this video, we’ll take a look at namedtuples and why you should use them.", "https://www.youtube.com/watch?v=GfxJYp9_nJA"], "123": ["Programming Terms: Idempotence", "In this programming terms video, we will be going over Idempotence. Idempotence is the property of certain operations in mathematics and computer science, that can be applied multiple times without changing the result beyond the initial application. Let’s take a look at this definition in-depth and go over a few examples.", "https://www.youtube.com/watch?v=UaKZ4wKytcA"], "124": ["Programming Terms: String Interpolation", "In this programming terms video, we will be going over string interpolation. String interpolation is the process of evaluating a string containing one or more placeholders and yielding a result in which the placeholders are replaced with their corresponding values. Let’s take a look at this definition in-depth and go over a few examples.", "https://www.youtube.com/watch?v=0q8spKeh1Kc"], "125": ["Programming Terms: DRY (Don’t Repeat Yourself)", "In this programming terms video, we will be going over the concept of DRY (Don’t Repeat Yourself). This is a term you will hear a lot if you are just getting started in Computer Science or if you’ve recently started a new programming job. Let’s take a look as to what it means to keep your code “DRY”.", "https://www.youtube.com/watch?v=IGH4-ZhfVDk"], "126": ["Python: What is the difference between str() and repr()?", "A common question that pops up when dealing with python is: What is the difference between __str__() and __repr__()? It may not be obvious right off the bat, so let’s take an in-depth look at this.", "https://www.youtube.com/watch?v=5cvM-crlDvg"], "127": ["Sublime Text Quick Tip: Launch Sublime Text from the Terminal", "If you navigate from your terminal frequently, you have most likely run into the scenario where you are within a project directory and want to open a file or folder from that project. It is a pain to open up Finder, navigate to the project, and open the file or directory that way. Being able to open these projects and files from the terminal is much more convenient and saves a lot of time. In this video we’ll look at how we can do just that:", "https://www.youtube.com/watch?v=4wMKGs2fe4s"], "128": ["How Web Developers, Designers, Programmers, and Software Engineers can volunteer their skills and give back to the community", "In this article, I wanted to talk about volunteering and different ways for Web Developers, Designers, Programmers, and Software Engineers to give back to their community using their skill-set.", "https://www.youtube.com/watch?v=HfABu4aCI3U"], "129": ["Git: Change DiffMerge Font-Size on Mac OSX", "In a previous video, we learned how to use DiffMerge as a git difftool and git mergetool. As I was creating that video, I noticed a bug in the program that crashed DiffMerge when attempting to change the font-size. This bug has not yet been fixed by DiffMerge; however, there is a workaround.", "https://www.youtube.com/watch?v=kjBA2WISteM"], "130": ["Git: Diff and Merge Tools", "In this video, we will learn how to setup a git difftool and a git mergetool. These tools provide a nice GUI interface for viewing and modifying diffs and merges.", "https://www.youtube.com/watch?v=iCGrKFH2oeo"], "131": ["Git: Using the Stash Command", "In this video, we will take a look at the git stash command. Git stash is extremely useful when you have some changes that you want to save but aren’t ready to make a commit.", "https://www.youtube.com/watch?v=KLEDKgMmbBI"], "132": ["An in-depth look at Python’s package management system, pip", "In this video, we will take an in-depth look at Python’s package management system, pip. We’ll walk through how to install, uninstall, list, and upgrade packages. We will also dive into how we can output our dependencies and install a list of dependencies.", "https://www.youtube.com/watch?v=U2ZN104hIcc"], "133": ["Python: virtualenv and why you should use virtual environments", "In this video, we will be looking at virtualenv and why you should be using virtual environments in Python. Virtual Environments in Python allow us to keep project-specific dependencies in a separate place than our global site-packages. This is extremely useful when you have different versions of packages for different projects.", "https://www.youtube.com/watch?v=N5vscPTWKOk"], "134": ["Resize Multiple Images Using the Mac Terminal", "One problem I run into frequently is needing to resize multiple images at once. To do this manually would take way too much time, especially if you have a lot of images.", "https://www.youtube.com/watch?v=HVMOBKRNEbc"], "135": ["Resize Multiple Images Using Picasa", "One problem I run into frequently is needing to resize multiple images at once. To do this manually would take way too much time, especially if you have a lot of images.", "https://www.youtube.com/watch?v=43eOoHpUW44"], "136": ["How to quickly create favicons for the desktop, Apple/Android devices, tablets, and more", "In this video, We will walk through the process of quickly creating favicons for your website or brand that look great almost any device using realfavicongenerator.net", "https://www.youtube.com/watch?v=LOFQH4fVAQY"], "137": ["Sublime Text Quick Tip: “Go To Definition” Click Shortcut", "In this Sublime Text Quick Tip, we’re going to see how we connect a mouse shortcut to the “Go To Definition” command.", "https://www.youtube.com/watch?v=DwTV5ogPdlU"], "138": ["Python: if __name__ == ‘__main__’", "In this video, we will take a look at a common conditional statement in Python:\nif __name__ == ‘__main__’:", "https://www.youtube.com/watch?v=sugvnHA7ElY"], "139": ["JavaScript Arrays: Properties, Methods, and Manipulation", "In this series, we will take an in-depth look at JavaScript Arrays, their properties, their methods, ways we can manipulate their values, and much more.", "https://www.youtube.com/watch?v=8JgU2WmrZXI"], "140": ["CSS Tips and Tricks: Add External URLs to Print Stylesheets", "Printing out URLs can be a nice edition to print stylesheets. When someone prints your article or blog post, you want them to know where your links would have taken them so that they can investigate those sources further if they desire.", "https://www.youtube.com/watch?v=jF-OQ-BrIAM"], "141": ["Mac Tip: Adding Folder Stacks to the Dock", "It’s easy for your dock to become cluttered with applications (E.g. Text editors, the Adobe suite, your Mac applications). It is possible to organize your applications into a single folder on the dock for easy access.", "https://www.youtube.com/watch?v=4glHQglQrU8"], "142": ["Understanding Binary, Hexadecimal, Decimal (Base-10), and more", "An introduction to binary and hexadecimal numbers. In this video, we will learn how to better understand binary and hexadecimal numbers. First, we will go over the base-10 system that we use on a daily basis. Once we grasp how a base-10 system is calculated, it will be much easier for us to understand how binary, hexadecimal, base-8, or any other base-n number is calculated.", "https://www.youtube.com/watch?v=ZL-LhaaMTTE"], "143": ["Sublime Text 3: Setup, Package Control, and Settings", "In this video, we’ll do a quick walkthrough on setting up a development environment using Sublime Text 3.", "https://www.youtube.com/watch?v=zVLJfrIwEP8"], "144": ["WordPress Tips: Test your theme with Theme Unit Test and Monster Widget", "When I first started developing WordPress sites, I found myself constantly adding dummy data so I could get an idea for how specific elements would look with my theme. Manually adding dummy data was not only slow, but it was also easy to leave out a lot of different test cases.", "https://www.youtube.com/watch?v=eGT0Z3oafFA"], "145": ["WordPress Plugins: Imsanity", "Imsanity is my favorite WordPress Plugin for keeping large image sizes under control.", "https://www.youtube.com/watch?v=obsje6AO3U8"], "146": ["Mac Tip: Screenshots", "I am frequently taking screenshots of what I am doing on screen. It’s useful to know all the options you have in order to make this quick and simple. In this video, I’ll go over the different ways in which you can take some basic screen shots on your Mac, and look a few advanced techniques as well.", "https://www.youtube.com/watch?v=VmQq1o1taOA"], "147": ["ArcGIS API for JavaScript: Starting Templates", "This is the second part of a multi-part series on using the ArcGIS API for JavaScript. In this walkthrough, we will take a look at some of the ESRI starting templates for our web map.", "https://www.youtube.com/watch?v=AMlNnhdJOo8"], "148": ["Terminal 101: Creating Aliases", "In this quick tip, we’re going to look at how to create aliases for common terminal commands. If you find yourself typing in the same commands over and over, then it is a good indication that you should write an alias for that. For example, I used to frequently switch to my website’s local theme directory using the command:", "https://www.youtube.com/watch?v=0liXeoADU6A"], "149": ["Mac Tip: Windows’ Best Features on Mac with HyperDock", "I work on both Windows and Mac machines. I am a huge fan of developing on my Mac, BUT I do find myself missing certain features from Windows. Mainly the windows snapping feature, and the ability to quickly preview open applications on the taskbar/dock.", "https://www.youtube.com/watch?v=g0O86DQnDiA"], "150": ["ArcGIS API for JavaScript Part 1: First Web Map", "This will be the first part of a multi-part series on how to use the ArcGIS API for JavaScript. In this video, we will start by setting up a basic web map with HTML, JavaScript, and CSS. Unlike the samples on the ArcGIS website, we will separate out our scripts and stylesheets so that our application will be easier to maintain as it grows. Let’s get started:", "https://www.youtube.com/watch?v=-tsFnoKNtNc"], "151": ["Make an American Girl Doll Bed", "", null], "152": ["Sublime Text 2: Setup, Package Control, and Settings", "Here we’ll do a quick walkthrough on setting up a development environment using Sublime Text 2.", "https://www.youtube.com/watch?v=uOMk8MlE_v4"], "153": ["Using Font Awesome in Desktop Applications (OS X)", "A Quick walkthrough on how you can download and use the Font Awesome icon font in your Mac desktop applications such as Photoshop, GIMP, Illustrator, Pages, and more.", "https://www.youtube.com/watch?v=OlpVKUpraao"], "154": ["Build a Platform Bed Frame", "", null], "155": ["Make a Raised Dog Feeder", "", null], "156": ["Prevent Picasa from Scanning Folders", "I love using Picasa for viewing and editing my photos. What I don’t love is that it automatically scans and imports tons of unwanted photos by default. This creates a ton of clutter and makes it difficult for me to find the actual photos I want to work with. Fortunately it is easy to prevent Picasa from scanning folders.", null], "157": ["How to Build a Paver Patio", "", null], "158": ["Quick Tip: Use a Wooden Pallet as a Lumber Rack", "Making a lumber rack for the workshop is a task I’ve been putting off for a long time now. As I was cleaning up my shop the other day, I decided I needed to come up with a temporary solution for the pile of lumber on my floor. I’ve had an old wooden pallet in the corner of my shop for some time, so I decided to start loading what I could onto that. It was surprisingly more spacious and sturdy than I had first anticipated.", null], "159": ["How to Record Sound From Your Computer’s Speakers (Windows)", "At times, you may want to record sound from your computer’s speakers. The best way to do this is to use the audio output from your speakers as your input device in the recording software of your choice. You do not need a mic or any special equipment to do this. Just follow these instructions:", null], "160": ["Ems and Rems for Sizing", "Ems and Rems both are scalable units in CSS which are relative to a base font-size in pixels. So what’s the difference between the two?", null], "161": ["How to Build a Pergola", "", null], "162": ["Adding Custom Web Fonts to Your Web Site Using CSS Font-Face", "Adding custom web fonts to your website is one of those things that seems like it should be easier than it actually is. In this video tutorial, we’ll walk through how to add a custom font to your website using the FontSquirrel.com Web Font Generator. Let’s Get Started:", "https://www.youtube.com/watch?v=y2AlgMII1OU"]}